<?php


$a = array();
$a[0] = "호박";
$a[1] = "밀감";
$a[2] = "레몬";
$a[3] = "수박";

//echo $a;

$b = array("ㅎㅂ","밀","레몬","수박");
echo $b[1]."<br>";





$moon1  = array(1=>"일월", 2=>"이월", 3=>"삼월", 4=>"사월", 5=>"오월", 6=>"육월",
                7=>"칠월", 8=>"팡뤌", 9=>"구월", 10=>"십월", 11=>"십일월", 12=>"십이월");

echo $moon1[11]."<br>";


$moon2  = array("일월"=>1, "이월"=>2, "삼월"=>3, "사월"=>4, "오월"=>5, "육월"=>6,
                7=>"칠월", 8=>"팡뤌", 9=>"구월", 10=>"십월", 11=>"십일월", 12=>"십이월");
echo $moon2["일월"]."<br>";
// index가 문자열인 경우 연관배열
 ?>
